TITLE lab3-ex07

INCLUDE Irvine32.inc

; h) Напишите программу,  которая бы отображала один символ во всех возможных комбинациях его цветов и цветов фона.
; Должна получиться матрица размером 16 x 16 = 256. Значения цветовых констант находятся в диапазоне 0..15, 
; поэтому для генерации всех возможных комбинаций следует пользоваться вложенными циклами.
; 15 + 1 * 16
; textColor + (backgrroundColor * 16)

; 15 31 47 63 79 95 111 127 143 159 175 191 207 223 239 
; 14 30 46 62 78 94 110 126 142 158 174 190 206 222 238 
; 13 29 45 61 77 93 109 125 141 157 173 189 205 221 237 
; 12 28 44 60 76 92 108 124 140 156 172 188 204 220 236 
; 11 27 43 59 75 91 107 123 139 155 171 187 203 219 235 
; 10 26 42 58 74 90 106 122 138 154 170 186 202 218 234 
; 9 25 41 57 73 89 105 121 137 153 169 185 201 217 233 
; 8 24 40 56 72 88 104 120 136 152 168 184 200 216 232 
; 7 23 39 55 71 87 103 119 135 151 167 183 199 215 231 
; 6 22 38 54 70 86 102 118 134 150 166 182 198 214 230 
; 5 21 37 53 69 85 101 117 133 149 165 181 197 213 229 
; 4 20 36 52 68 84 100 116 132 148 164 180 196 212 228 
; 3 19 35 51 67 83 99 115 131 147 163 179 195 211 227 
; 2 18 34 50 66 82 98 114 130 146 162 178 194 210 226 
; 1 17 33 49 65 81 97 113 129 145 161 177 193 209 225 
; 0 16 32 48 65 80 96 112 128 144 160 176 192 208 224

.data
	symbol BYTE '#'
	color DWORD ?

	
.code
main PROC
	call ClrScr
	mov ecx, 16
	mov edx, 15
L1:
; save value
	mov ebx, ecx
	mov	color, edx
	mov eax, color
	call SetTextColor
	
	mov ecx, 16
L2:	
	mov al, symbol
	call WriteChar
	
	add color, 16
	mov eax, color
	call SetTextColor

	loop L2

	call CrLf
	mov ecx, ebx
	dec edx
	loop L1

	mov eax, white
	call SetTextColor
	exit
main ENDP
END main